packages/pspman/pspman-21.3.13.tar.gz/pspman-21.3.13/docs/_plan/plan.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-26 Fri 18:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>pspman plan</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pradyumna Paranjape" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/bigblow_theme/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">pspman plan</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd3df507">Faculties</a></li>
<li><a href="#orgf306ae8">Objects</a></li>
<li><a href="#org4d8cccd">Database</a></li>
<li><a href="#org9242c96">Choices</a></li>
<li><a href="#orga115368">Queues</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd3df507" class="outline-2">
<h2 id="orgd3df507">Faculties</h2>
<div class="outline-text-2" id="text-orgd3df507">
<ul class="org-ul">
<li>List</li>
<li>Update
<ul class="org-ul">
<li>pull code</li>
<li>install</li>
</ul></li>
<li>Add</li>
<li>Remove</li>
<li>lock</li>
</ul>
</div>
</div>

<div id="outline-container-orgf306ae8" class="outline-2">
<h2 id="orgf306ae8">Objects</h2>
<div class="outline-text-2" id="text-orgf306ae8">
</div>
<div id="outline-container-org2df5e96" class="outline-3">
<h3 id="org2df5e96">Environment</h3>
<div class="outline-text-3" id="text-org2df5e96">
</div>
<div id="outline-container-org07a99da" class="outline-4">
<h4 id="org07a99da">Clone dir</h4>
<div class="outline-text-4" id="text-org07a99da">
<p>
Parent directory root for all projects
</p>
</div>
</div>
<div id="outline-container-org6fab7bf" class="outline-4">
<h4 id="org6fab7bf">Prefix</h4>
<div class="outline-text-4" id="text-org6fab7bf">
<p>
Prefix for installations
</p>
</div>
</div>
</div>
<div id="outline-container-org7945b0f" class="outline-3">
<h3 id="org7945b0f">Project</h3>
<div class="outline-text-3" id="text-org7945b0f">
</div>
<div id="outline-container-org15393df" class="outline-4">
<h4 id="org15393df">URL</h4>
<div class="outline-text-4" id="text-org15393df">
<p>
URL to clone
</p>
</div>
</div>
<div id="outline-container-orgfa9a8ac" class="outline-4">
<h4 id="orgfa9a8ac">name</h4>
<div class="outline-text-4" id="text-orgfa9a8ac">
<p>
Name of directory (Also name of project)
</p>
</div>
</div>
<div id="outline-container-org76a2f02" class="outline-4">
<h4 id="org76a2f02">Base Tag</h4>
<div class="outline-text-4" id="text-org76a2f02">
<p>
Base Tag of project
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org4d8cccd" class="outline-2">
<h2 id="org4d8cccd">Database</h2>
<div class="outline-text-2" id="text-org4d8cccd">
<p>
<b>Structure</b>: hidden yaml file
</p>
</div>
<div id="outline-container-org45eb897" class="outline-3">
<h3 id="org45eb897">Contents</h3>
<div class="outline-text-3" id="text-org45eb897">
</div>
<div id="outline-container-orgab7e814" class="outline-4">
<h4 id="orgab7e814">git_projects</h4>
<div class="outline-text-4" id="text-orgab7e814">
<ul class="org-ul">
<li><b>format</b>: name: gp_data</li>
<li><b>name</b>: name of git_project</li>
<li><b>gp_data</b>: GitProject.__dict__()</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org9242c96" class="outline-2">
<h2 id="org9242c96">Choices</h2>
<div class="outline-text-2" id="text-org9242c96">
</div>
<div id="outline-container-org02ac33f" class="outline-3">
<h3 id="org02ac33f">Force Risk</h3>
<div class="outline-text-3" id="text-org02ac33f">
<ul class="org-ul">
<li>Force risky installation as root</li>
</ul>
</div>
</div>
<div id="outline-container-orge1500d6" class="outline-3">
<h3 id="orge1500d6">Stale</h3>
<div class="outline-text-3" id="text-orge1500d6">
<ul class="org-ul">
<li>Do not try to update existing projects</li>
</ul>
</div>
</div>

<div id="outline-container-org7d52d40" class="outline-3">
<h3 id="org7d52d40">Only Pull</h3>
<div class="outline-text-3" id="text-org7d52d40">
<ul class="org-ul">
<li>Do not install projects</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga115368" class="outline-2">
<h2 id="orga115368">Queues</h2>
<div class="outline-text-2" id="text-orga115368">
</div>
<div id="outline-container-org51480d2" class="outline-3">
<h3 id="org51480d2">PullQueue:</h3>
<div class="outline-text-3" id="text-org51480d2">
<p>
Queue to pull projects
</p>
<ul class="org-ul">
<li>Rate limited by <i>speed of internet</i></li>
<li>Speed: 2</li>
<li>Chronology: 1</li>
</ul>
</div>
</div>

<div id="outline-container-org1be8b8b" class="outline-3">
<h3 id="org1be8b8b">InstallQueue:</h3>
<div class="outline-text-3" id="text-org1be8b8b">
<p>
Queue for installation of projects
</p>
<ul class="org-ul">
<li>Rate limited by <i>speed of processor\/RAM</i></li>
<li>Speed: 1</li>
<li>Chronology: 2</li>
</ul>
</div>
</div>

<div id="outline-container-org3afc6f7" class="outline-3">
<h3 id="org3afc6f7">ErrorQueue:</h3>
<div class="outline-text-3" id="text-org3afc6f7">
<p>
Handle Errors
</p>
<ul class="org-ul">
<li>Rate limited by <i>action to be taken (user input)</i></li>
<li>Speed: 3</li>
<li>Chronology: 3</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
